# Proyecto: Ordenamiento avanzado de datos (ordenamiento por valores)

En el presente script veremos como se pueden ordenar los datos en un dataframe, de acuerdo a sus valores.

Algunas de las funciones que usamos son:

`.sort_values('column_name', ascending=True)` <- Ordena un dataframe de acuerdo al oden ascendente de los valores de una columna especificada.

`.sort_values('column_name', ascending=False)` <- Ordena un dataframe de acuerdo al oden descendente de los valores de una columna especificada.

`.sort_values(by=['column_1',...,'column:N'])` <- Ordena el dataframe de acuerdo al orden ascendente de los valores de varias columnas.

`.sort_values(by=['column_1',...,'column:N'], ascending=[True,False,...,True])` <- Ordena el dataframe (de acuerdo al orden ascendente especificado en 'ascending') de los valores de varias columnas.

`.sort_values(by=['column_name']],key=lambda x:x.str.len())` <- Ordena el dataframe de auerdo al tamaño de caracteres en las cadenas de una columna especifica.

`.sort_values(by=M,axis=1)` <- Ordena el dataframe de acuerdo al orden de los valores en el M-ésimo renglón.

In [2]:
import pandas as pd
df=pd.read_csv('./data1.csv') 
df

   EmpID   Salary       Skill
0     21  15000.0      Python
1     12      NaN      python
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript
4     10  10000.0      PYTHON

### Sorting values by one column "EmpID"

In [5]:
# Ordenamos de acurdo a valores de una columna específica (de forma ascendente):
df.sort_values('EmpID', ascending=True)

   EmpID   Salary       Skill
3      7  12000.0  JavaScript
4     10  10000.0      PYTHON
1     12      NaN      python
2     15   5000.0  JavaScript
0     21  15000.0      Python

### Sorting values by one column "EmpID" in descending order

In [4]:
# Ordenamos de acuerdo a valores de una columna específica (de forma descendente):
df.sort_values('EmpID',ascending=False)

   EmpID   Salary       Skill
0     21  15000.0      Python
2     15   5000.0  JavaScript
1     12      NaN      python
4     10  10000.0      PYTHON
3      7  12000.0  JavaScript

### Sorting values based on two columns "Skill" and "EmpID"

In [6]:
# Primero se ordena de acuerdo a los valores de una columna y después de acuerdo a valores de otra columna:
df.sort_values(by=['Skill','EmpID'])

   EmpID   Salary       Skill
3      7  12000.0  JavaScript
2     15   5000.0  JavaScript
4     10  10000.0      PYTHON
0     21  15000.0      Python
1     12      NaN      python

### Sorting dataframe by one column "Skill"

In [11]:
# Ordenamos de acuerdo a valores de una columna específica (de forma ascendente):
df.sort_values(by=['Skill'], ascending=True)

   EmpID   Salary       Skill
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript
4     10  10000.0      PYTHON
0     21  15000.0      Python
1     12      NaN      python


### Sorting dataframe by two column in two different order

In [12]:
# Ordenamos de acuerdo a valores de diferentes columnas, cada una con diferente orden (ascentente o descendente)
df.sort_values(by=['Skill','EmpID'],ascending=[True,False])

   EmpID   Salary       Skill
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript
4     10  10000.0      PYTHON
0     21  15000.0      Python
1     12      NaN      python

### Sorting dataframe by putting NaN values first

In [15]:
# Establecemos los valores NaN al principio:
df.sort_values('Salary',na_position='first')

   EmpID   Salary       Skill
1     12      NaN      python
2     15   5000.0  JavaScript
4     10  10000.0      PYTHON
3      7  12000.0  JavaScript
0     21  15000.0      Python

### Sorting in place

In [17]:
# 'inplace=True' <-- guarda los cambios dentro del dataframe
df.sort_values('Salary',inplace=True)
df

   EmpID   Salary       Skill
2     15   5000.0  JavaScript
4     10  10000.0      PYTHON
3      7  12000.0  JavaScript
0     21  15000.0      Python
1     12      NaN      python

### Sorting by ignoring index

In [19]:
# 'ignore_index=True' <-- Al aplicar la ordenación se renombran índices nuevos
df.sort_values('Salary',ignore_index=True)

   EmpID   Salary       Skill
0     15   5000.0  JavaScript
1     10  10000.0      PYTHON
2      7  12000.0  JavaScript
3     21  15000.0      Python
4     12      NaN      python

### Sorting dataframe by applying key function

In [20]:
# 'inplace=True' <-- guarda los cambios dentro del dataframe
df.sort_index(inplace=True)

In [21]:
df.sort_values(by=["Skill"],key=lambda x:x.str.lower())

   EmpID   Salary       Skill
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript
0     21  15000.0      Python
1     12      NaN      python
4     10  10000.0      PYTHON

In [22]:
df.sort_values(by=["Skill"])

   EmpID   Salary       Skill
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript
4     10  10000.0      PYTHON
0     21  15000.0      Python
1     12      NaN      python

In [23]:
# Ordena de acuerdo al número de caracteres en las cadenas de la columna 'Skill'
df.sort_values(by=["Skill"],key=lambda x:x.str.len())

   EmpID   Salary       Skill
0     21  15000.0      Python
1     12      NaN      python
4     10  10000.0      PYTHON
2     15   5000.0  JavaScript
3      7  12000.0  JavaScript

### Sorting dataframe by row values

In [24]:
df = pd.DataFrame(data={'x':[10,30,20], 'y':[1,2,3],'z':[5,15,10]})
df

    x  y   z
0  10  1   5
1  30  2  15
2  20  3  10

In [25]:
# Ordena de acuerdo a los valores del renglón con índice 0
df.sort_values(by=0,axis=1)

   y   z   x
0  1   5  10
1  2  15  30
2  3  10  20

In [26]:
df1 = pd.DataFrame(data={'x':[10,10,"d"], 'y':['a',5,'c'],'z':[5,15,'a']})
df1

    x  y   z
0  10  a   5
1  10  5  15
2   d  c   a

In [27]:
# Ordena de acuerdo a los valores del renglón con índice 1
df1.sort_values(by=1,axis=1)

   y   x   z
0  a  10   5
1  5  10  15
2  c   d   a

In [29]:
# Ordena de acuerdo a los valores del renglón con índice 2

df1.sort_values(by=2,axis=1)

    z  y   x
0   5  a  10
1  15  5  10
2   a  c   d